[
    {
        "semesterId": "s24",
        "semesterName": "Spring 2024",
        "courses": [
            {
                "id": "c1",
                "number": "10-315",
                "name": "Introduction to Machine Learning (SCS Majors)",
                "desc": "Delves into machine learning, encompassing core concepts, algorithms, and applications, with emphasis on practical skills in selecting and applying supervised and unsupervised learning methods, and understanding key principles like model selection and overfitting."
            },
            {
                "id": "c2",
                "number": "17-214",
                "name": "Principles of Software Construction: Objects, Design, and Concurrency",
                "desc": "Explores advanced software construction techniques, focusing on object-oriented design, static and dynamic program analysis, and concurrency concepts, culminating in a medium-sized Java project."
            },
            {
                "id": "c3",
                "number": "15-213",
                "name": "Introduction to Computer Systems",
                "desc": "Provides an in-depth understanding of computer systems from a programmer's viewpoint, focusing on execution, storage, and communication to improve performance and reliability, and prepares for further study in areas like compilers and operating systems."
            },
            {
                "id": "c4",
                "number": "94-886",
                "name": "Advances in Robotic Process Automation",
                "desc": "Introduces Robotic Process Automation fundamentals, emphasizing AI and machine learning integration, process identification for automation, and strategic consultancy for real-world automation projects."
            },
            {
                "id": "c5",
                "number": "36-226",
                "name": "Introduction to Statistical Inference",
                "desc": "Explores advanced statistical methods, focusing on data analysis, estimation techniques, hypothesis testing, and linear models, with a practical approach to applying statistical theory."
            }
        ]
    },
    {
        "semesterId": "f23",
        "semesterName": "Fall 2023",
        "courses": [
            {
                "id": "c1",
                "number": "15-351",
                "name": "Algorithms and Advanced Data Structures",
                "desc": "Examines algorithm design principles and the efficient data structures that support them, covering topics like run time analysis, various algorithmic strategies, and NP-completeness, with a focus on theoretical problem-solving rather than programming."
            },
            {
                "id": "c2",
                "number": "95-882",
                "name": "Enterprise Web Development",
                "desc": "Explores the intricacies of enterprise web application development, focusing on server-side programming, n-tier architecture, and user-centric personalization, culminating in the hands-on creation of a comprehensive web application utilizing technologies like PHP, Django, and MySQL."
            },
            {
                "id": "c33",
                "number": "36-315",
                "name": "Statistical Graphics and Visualization",
                "desc": "Introduces common graphical displays for quantitative data, their creation, interpretation, and potential pitfalls, alongside a project applying these methods to real-world scientific or engineering data, complemented by practical lab sessions on graphical software usage."
            },
            {
                "id": "c4",
                "number": "36-350",
                "name": "Statistical Computing",
                "desc": "Introduces statistical computing for statisticians, covering fundamental programming concepts and statistical applications like data analysis and linear models, using R language."
            },
            {
                "id": "c5",
                "number": "79-261",
                "name": "The Last Emperors: Chinese History and Society, 1600-1900",
                "desc": "Introduces the Qing dynasty in late-imperial China, exploring its multi-ethnic empire, societal transformations, responses to 19th-century challenges including Western imperialism, and the eventual fall of the imperial system and subsequent societal reformation."
            }
        ]
    },
    {
        "semesterId": "s22",
        "semesterName": "Spring 2022",
        "courses": [
            {
                "id": "c1",
                "number": "73-102",
                "name": "Principles of Microeconomics",
                "desc": "Introduces microeconomic principles and economic reasoning, examining individual decision-making, market dynamics, the role of government, and strategic interaction, with a practical approach to understanding everyday economic questions and building a toolkit for market analysis."
            },
            {
                "id": "c2",
                "number": "48-241",
                "name": "History of Modern Architecture",
                "desc": "Investigates the global evolution of 20th-century modern architecture and theory, questioning established narratives and examining the impact of colonialism, globalization, and capitalism, while considering diverse worldwide architectural responses, with content that adapts annually to reflect contemporary understandings and contexts."
            },
            {
                "id": "c3",
                "number": "82-138",
                "name": "Comparative China: Perceptions Through Youtube & TikTok",
                "desc": "Explores how China is portrayed through various media, particularly emerging platforms like YouTube and TikTok, encouraging critical evaluation and cross-cultural analysis of these depictions to deepen understanding of Chinese society, culture, and its global perception."
            }
        ]
    },
    {
        "semesterId": "f21",
        "semesterName": "Fall 2021",
        "courses": [
            {
                "id": "c1",
                "number": "36-225",
                "name": "Introduction to Probability Theory",
                "desc": "Introduces probability and mathematical statistics for data science students, covering basic theory, random variables, various distributions, and foundational principles like the law of large numbers and the central limit theorem."
            },
            {
                "id": "c2",
                "number": "03-125",
                "name": "Evolution",
                "desc": "Provides an essential understanding of evolutionary theory as the cornerstone of biology, covering its history, foundational facts, phylogenetics, genetics, and mechanisms driving life's diversity, along with specialized topics like evolutionary medicine and genome evolution."
            },
            {
                "id": "c3",
                "number": "57-173",
                "name": "Survey of Western Music History",
                "desc": "Surveys the evolution of European art music from Gregorian chant to contemporary works, focusing on influential figures and themes, especially those concerning period style and performance interpretation."
            }
        ]
    },
    {
        "semesterId": "s21",
        "semesterName": "Spring 2021",
        "courses": [
            {
                "id": "c1",
                "number": "36-302",
                "name": "Methods for Statistics & Data Science",
                "desc": "Advances statistical principles, delving into regression analysis, logistic regression, ANOVA, and introductory machine learning, with a strong emphasis on using R Studio for data analysis and model creation, culminating in projects that synthesize statistical methods, reproducibility, and ethical considerations in data use."
            },
            {
                "id": "c2",
                "number": "21-122",
                "name": "Integration and Approximation",
                "desc": "Covers integration techniques like trigonometric substitution and partial fractions, numerical integration methods, differential equations, optimization algorithms, Taylor's Theorem with remainders, and series analysis, alongside parametric curves, polar coordinates, and vector fundamentals, delivered through lectures and recitations."
            },
            {
                "id": "c3",
                "number": "66-131",
                "name": "Culture, Sports, and Conflict in/and VR",
                "desc": "Examines sports as a reflection of cultural and societal values and explores how Virtual Reality (VR) can craft narratives to enhance user engagement with these perspectives, culminating in student-designed immersive experiences on sports conflicts for display in the Askwith Kenner Global Languages and Cultures Room."
            },
            {
                "id": "c4",
                "number": "76-107",
                "name": "Writing about Data",
                "desc": "Focuses on interpreting and crafting arguments with numerical and qualitative data across various disciplines, including assessing how research is portrayed in media and developing skills for communicating data to diverse audiences, with a final project of writing an original data-driven research proposal."
            },
            {
                "id": "c5",
                "number": "76-108",
                "name": "Writing about Public Problems",
                "desc": "Teaches how to define and argue public problems through analysis of proposals, op-eds, and white papers, preparing students to write persuasive solutions for complex issues and to address varied stakeholders, culminating in crafting their own proposal for solving a real-world problem."
            }
        ]
    },
    {
        "semesterId": "f20",
        "semesterName": "Fall 2020",
        "courses": [
            {
                "id": "c1",
                "number": "15-122",
                "name": "Principles of Imperative Computation",
                "desc": "Teaches imperative programming and methods for ensuring program correctness, guiding students from high-level algorithm concepts to the implementation of data structures and algorithms in a subset of C, preparing for advanced Computer Science courses."
            },
            {
                "id": "c2",
                "number": "21-240",
                "name": "Matrix Algebra with Applications",
                "desc": "Covers linear algebra topics including vectors, matrices, system solutions, vector spaces, orthogonality, determinants, eigenvalues, and eigenvectors, tailored for students in Economics, Statistics, and Information Systems, with a focus on applicable concepts."
            },
            {
                "id": "c3",
                "number": "21-256",
                "name": "Multivariate Analysis",
                "desc": "Focuses on matrix algebra and optimization for Economics and Business Administration students, covering vectors, dot and cross products, partial derivatives, gradients, optimization techniques, and multiple integration, including applications in probability."
            },
            {
                "id": "c4",
                "number": "36-200",
                "name": "Reasoning with Data",
                "desc": "Introduces statistical decision-making and reasoning with various data types, emphasizing critical analysis of empirical problems and the use of statistical tools to evaluate hypotheses. Methodological topics include exploratory data analysis, probability, and significance tests, applied across interdisciplinary case studies."
            },
            {
                "id": "c5",
                "number": "79-104",
                "name": "Global Histories",
                "desc": "Provides students with the skills to comprehend global interconnectivity and history, encouraging critical thinking, effective argumentation, and appreciation of historical relevance through a blend of lectures, recitations, and written assessments."
            }
        ]
    }
]